       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM1    PIC 9(4) VALUE 0.
       01 WS-NUM2    PIC 9(4) VALUE 0.
       01 WS-RESULT  PIC 9(8) VALUE 0.

       PROCEDURE DIVISION.
           MOVE 1234 TO WS-NUM1
           MOVE 5678 TO WS-NUM2
           COMPUTE WS-RESULT = WS-NUM1 + WS-NUM2
           DISPLAY WS-RESULT
           STOP RUN.
