       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYROLL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-HOURS      PIC 9(3) VALUE 0.
       01 WS-RATE       PIC 9(4) VALUE 0.
       01 WS-OVERTIME   PIC 9(4) VALUE 0.
       01 WS-GROSS-PAY  PIC 9(8) VALUE 0.

       PROCEDURE DIVISION.
           MOVE 45   TO WS-HOURS
           MOVE 2000 TO WS-RATE
           COMPUTE WS-GROSS-PAY = WS-HOURS * WS-RATE
           DISPLAY WS-GROSS-PAY
           STOP RUN.
